import org.apache.commons.lang3.StringUtils;

public class Main {
    public static void main(String[] args) {
        System.out.println(StringUtils.upperCase("Hello!"));
    }
}






/*
Задание 21.1.2
        Чтобы лучше понять процесс ручной сборки, скомпилируйте и запустите проект самостоятельно. Для этого выполните следующие действия:

    1 Создайте класс с методом main, который выполняет какое-либо действие (например, складывает два числа или выводит любую строку).
    2 Скомпилируйте созданный класс, используя команду javac. Убедитесь, что создался файл с расширением .CLASS.
    3 Запустите выполнение вашей программы, используя команду:
        java yourfilename
    4 Убедитесь, что программа выполняется успешно.

    Теперь запустите программу, имеющую стороннюю зависимость.

    1 Добавьте зависимость в свою программу.
        Как добавить зависимость в программу
    2 Запустите компиляцию нового файла, используя команду:
        javac YourFileName.java
        Если вы следовали инструкциям по созданию зависимости, указанным под спойлером, компилятор должен выдать ошибку, так как не нашёл вашей зависимости.
    3 Скомпилируйте свой файл, изменив команду, указав в ней путь до стороннего JAR.
    4 Соберите всё в JAR-архив.
    5 Запустите новую версию, используя команду:
        java -cp YourJarName.jar:yourDependency.jar YourFileName
    6 Убедитесь, что программа отработала корректно.
 */